Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Participants must develop Norwegian language skills that allow them to remain informed about relevant topics associated with social, economic, geographical and environmental circumstances in society and to participate in conversations and discussions about these topics.
nb: Deltakerne skal utvikle norskferdigheter som gjør det mulig å holde seg informert om relevante temaer knyttet til sosiale, økonomiske, geografiske og miljømessige forhold i samfunnet og delta i samtaler og diskusjoner om disse temaene.

source: • understand information in notifications, messages and detailed instructions;
nb: • forstå informasjon i meldinger, beskjeder og detaljerte instruksjoner

source: • convey the content of images and simple spoken information;
nb: • videreformidle innholdet i bilder og enkel muntlig informasjon

source: Some people have an agreement of five weeks of holiday and receive 12 per cent holiday pay.
nb: Noen har avtale om fem uker ferie og får 12 % i feriepenger.

source: • read lists of tools and equipment required for various
nb: varer• lese lister over verktøy og utstyr som kreves for ulike

source: audiovisual clips, e.g. news broadcasts, if spoken slowly and clearly;
nb: audiovisuelle klipp, for eksempel nyhetssendinger, dersom det snakkes sakte og tydelig

source: The competence aims in this curriculum describe the objectives of the training in oral, listening, reading and writing skills in Norwegian.
nb: Kompetansemålene i denne læreplanen beskriver mål for opplæringen innen språkferdighetene muntlig, lytte, lese og skrive.

source: very simple diagrams and tables;
nb: svært enkle diagrammer og tabeller

source: related to themselves, their learning and work situations and society, and topics of personal interest when their conversation partners speak clearly and at a moderate speed.
nb: Mål for opplæringen er at deltakeren skal kunne forstå hovedinnholdet og enkelte spesifikke detaljer i tale om kjente emner knyttet til egen livssituasjon, opplæring, arbeids- og samfunnsliv og emner av personlig interesse når det snakkes tydelig og med moderat talehastighet.

source: • participate in simple conversations about events, experiences and practical
nb: • delta i enkle samtaler om hendelser, opplevelser og praktiske gjøremål i

source: texts from one or more sources and then convey their own understanding and interpretation in a clear and well-structured way;
nb: og/eller skriftlige tekster fra en eller flere kilder for deretter å videreformidle egen forståelse og tolkning på en klar og velstrukturert måte.

source: They can take pictures from the walk and show them to the class for discussion or as a basis for assignments.
nb: En kan også gå ut sammen og studere tekst- og tallinformasjon som finnes på skilt, på oppslag og i butikkvinduer.

source: reformulate themselves in most situations;
nb: omformulere seg i de fleste situasjoner.

source: they understand or need clarification, and asking if others understand.
nb: man forstår eller trenger oppklaring, og spørre om andre forstår

source: • Complicity in a forced marriage is punishable in the same way.
nb: • Medvirkning til tvangsekteskap straffes på samme måte.

source: • Violent extremism may be associated with
nb: • Både barnehage og skole har som oppgave å

source: The term can be defined as ‘the ability to communicate expediently and appropriately with people of a different background’ (Bøhn & Dypedahl, 2009).
nb: Begrepet kan beskrives som «evnen til å kommunisere hensiktsmessig og passende med mennesker som har en annen bakgrunn» (Bøhn og Dypedahl, 2009).

source: The objective of the training is for participants to be able to use very simple phrases and sentences to talk about themselves and matters relating to their lives.
nb: Mål for opplæringen er at deltakeren skal kunne bruke svært enkle fraser og setninger for å snakke om seg selv og nære forhold.

source: Participants’ skills and experiences, different cultural backgrounds and multilingual resources must be recognised and provide a foundation for further learning.
nb: Deltakernes medbrakte kompetanse og erfaringer, ulik kulturell bakgrunn og flerspråklige ressurser skal anerkjennes og danne grunnlag for videre læring.

source: This is a new class and the pupils do not know each other very well, but this did not appear to have a major impact on the cooperation, which took place in small groups.
nb: Elev-ene er nye i klassen og kjenner hverandre dårlig, men dette viser seg å ikke ha stor betydning for samarbeidet (som foregår i smågrupper).

source: Participating in society by means of digital aids is the topic of an ethnographic study conducted by Silvia Noguerón-Liu (2013) among three Spanish-speaking immigrants in the USA.
nb: Deltakelse i samfunnet ved hjelp av digitale hjelpemidler er tema i en etnografisk studie som Silvia Nogu-erón-Liu (2013) har gjennomført blant tre spanskspråklige innvandrere i USA.

source: • read and understand numbers in everyday life, such as prices and times;
nb: • lese og forstå tall i dagliglivet, for eksempel priser og tider

source: • report and document damages to equipment or people
nb: • Transport i lokalmiljøet og enkle trafikkregler

source: • Forced marriages are not valid under Norwegian law and may be
nb: • En ektefelle som har blitt tvunget til å inngå ekteskap,

source: • give a prepared presentation on a familiar topic, both with and without the
nb: • holde en forberedt presentasjon om et kjent emne, både med og uten bruk

source: Competence aims for level A2 (basic user)
nb: Kompetansemål for nivå A2 (basisbruker)

source: informative texts, e.g. short official letters and documents, websites and brochures;
nb: informative tekster, for eksempel korte offentlige brev og dokumenter, nettsider og brosjyrer

source: Messina Dahlberg & Bagga-Gupta (2014) describe how a digital language course can be affected by the par-ticipants’ different linguistic and cultural backgrounds.
nb: Hvordan et digitalt språkkurs kan påvirkes av deltakernes ulike språklige og kulturelle bakgrunn er beskrevet av Messina Dahlberg & Bagga-Gupta (2014).

source: • express their own opinions and discuss and comment on other people’s input
nb: • uttrykke egne meninger og diskutere og kommentere andres innspill i digital

source: The learner can navigate complex texts efficiently.
nb: Innlæreren kan på en effektiv måte orientere seg i komplekse tekster.

source: • discuss the core values of the Norwegian school and educational system,
nb: • samtale om sentrale verdier som det norske skole- og utdanningssystemet

source: At level A2, participants can understand clear, simple language and can express themselves in simple terms in relation to familiar topics related to themselves and their surroundings, their learning and work situations, and society.
nb: På nivå A2 kan deltakeren forstå klart, enkelt språk og uttrykke seg enkelt om kjente emner knyttet til egen person, nære omgivelser, opplæring og arbeids- og samfunnsliv.

source: • write and respond to very simple messages about specific, familiar topics
nb: • skrive og svare på svært enkle meldinger om konkrete, kjente emner og

source: • The Marriage Act also applies to marriages entered into outside Norway.
nb: • Ekteskapsloven gjelder også for ekteskap som inngås i utlandet.

source: Finally, we would like to mention the study by Collin, Saffari & Kamta (2015) which looks at newly arrived immigrants’ digital skills and use of computers/the internet in French-speaking Canada, with particular empha-sis on to what extent and how they use digital technology (e.g. use digital dictionaries) for school-related purposes.
nb: Avslutningsvis vil vi nevne Collin, Saffari & Kamta (2015), som undersøker nylig ankomne innvandreres digitale ferdigheter og bruk av pc/nett i franskspråklig Canada, med spesiell vekt på i hvilken grad og hvordan de bruker digital teknologi til skolerelaterte formål (eksempelvis bruk digitale ordbøker).

source: • write, read and understand the use of numbers in everyday life;
nb: • skrive, lese og forstå bruken av tall i dagliglivet

source: Participants can take part in very simple, familiar interactions if their conversation partners adapt their language and are supportive.
nb: Deltakeren kan delta i svært enkle, kjente samhandlingssituasjoner dersom samhandlingspartnerne tilpasser språket og er støttende.

source: – Family planning and access to contraception
nb: – Familieplanlegging og tilgang til prevensjon

source: NTNU has also dev
nb: NTNU har også utviklet

source: Vestfold county authority of
nb: og Vestfold fylkeskom-mune tilb

source: • read and understand the main features of complex texts that contain simple
nb: • lese og forstå hovedtrekk i sammensatte tekster som inneholder enkle

source: If you have any questions about the date of your test, contact the test centre.
nb: Har du spørsmål om dato for prøven din, må du kontakte prøvestedet ditt.

source: • read and understand clear and straightforward instructions;
nb: • lese og forstå klare og greie instruksjoner

source: Level 3 An ability to read and write at Level 3 includes reading and writing comprehensible texts.
nb: NIVÅ 3 Å kunne lese og skrive på nivå 3 innebærer at en behersker formelle krav til et mangfold av tekster.

source: For some people, this means gaining Norwegian language skills that allow them to utilise their inherent basic skills in Norwegian-language contexts, while others will need adaptation and systematic work in order to develop basic skills throughout the training.
nb: For noen vil dette innebære å få norskferdigheter til å kunne nyttiggjøre seg medbrakte grunnleggende ferdigheter i norskspråklige sammenhenger, mens andre vil ha behov for tilrettelegging og systematisk arbeid med å utvikle grunnleggende ferdigheter gjennom hele opplæringen.

source: NUMERACY TRAINING AND THE USE OF BILINGUAL ASSISTANTS | 14
nb: -fortelle om inntekter, utgifter og forbruk på en svært enkel måteBASISMATEMATIKK OG BRUK AV SPRÅKHJELPERE | 14

source: • edit, summarise and accurately convey the main content of complex texts
nb: • bearbeide, sammenfatte og videreformidle på en pålitelig måte

source: of view, and discuss the pros and cons of different alternatives;
nb: bestemt synspunkt og drøfter fordelene og ulempene ved ulike alternativer

source: • write text messages and emails
nb: • skrive SMS og e-post

source: Ole, who owns the apartment, is asleep next to her, naked.
nb: Ole, som eier leiligheten, sover naken ved siden av henne.

source: With a view to security and quality, many of the texts had to be written by the officers themselves.
nb: EVU har stor effekt for uføre voksne med al menn el er yrkesfaglig utdanning som tar ytterligere yrkes-faglig utdanning.

source: Learners can use the language flexibly and appropriately in social, academic and work-related contexts.
nb: Innlæreren kan bruke språket fleksibelt og hensiktsmessig til sosiale, akademiske og yrkesrelaterte formål.

source: • read information and forms related to their employment
nb: • lese sikkerhetsinstrukser for byggeplassen

source: • Taking girls who live in Norway to a foreign country to be circumcised is against
nb: • Det er forbudt å ta med jenter som er bosatt i Norge, til utlandet for omskjæring.

source: And how does online language learning actually work?
nb: Og hvordan fungerer egentlig språkopplæring når den er nettbasert?

source: The results show that the participants generally had a positive view of the educational use of Facebook.
nb: Resultatene viser at deltakerne jevnt over var positive til pedagogisk bruk av Facebook.

source: • read and understand a selection of fiction texts;
nb: • lese og forstå et utvalg av skjønnlitterære tekster

source: • read and understand simple fiction texts;
nb: • lese og forstå enkle skjønnlitterære tekster

source: messages and instructions, and times and directions;
nb: beskjeder, instruksjoner og tids- og stedsanvisninger

source: and recognise nuances and implicit attitudes and relationships between the speakers;
nb: film, og oppfatte nyanser og underforståtte holdninger og forhold mellom dem som snakker.

source: • spontaneously discuss many different topics as part of a flowing
nb: • samtale om mange ulike temaer med spontanitet og flyt og tilpasse språket

source: people aged under 16 is a criminal offence.
nb: seksuell omgang med barn og unge under 16 år er

source: Single parents and married couples with low income are in class 2.
nb: Enslige forsørgere og ektefeller med lav samlet inntekt er i klasse 2.

source: Learners can write clear, detailed and well-structured texts within a wide range of genres, and can adapt the language to the situation, the recipient and the message to be communicated.
nb: Innlæreren kan skrive klare, detaljerte og velstrukturerte tekster innenfor et bredt spekter av sjangre, og kan tilpasse språket etter situasjonen, mottakeren og budskapet som skal formidles.

source: • describe and provide information about people, objects, places, events and
nb: • beskrive og fortelle om personer, gjenstander, steder, hendelser og

source: In tax class 2 you get higher deductions and lower tax.
nb: I skatteklasse 2 får man et høyere fradrag og lavere skatt.

source: Yes, this is my girlfriend, Anna.
nb: Ja, det er kjæresten min, Anna.

source: • convey in simple terms details of their background, competence, wishes and
nb: • fortelle enkelt om egen bakgrunn, kompetanse, ønsker og planer for

source: important to her parents that Memona should get married?
nb: det er viktig for foreldrene at Memona gifter seg?

source: backgrounds are also exposed to forced marriage.
nb: minoritetsbakgrunn er også utsatt for tvangsekteskap.

source: • read and understand the main points in short, simple news reports and
nb: • lese og forstå hovedpunkter i korte, enkle nyhetsmeldinger og enkle,

source: • employ simple strategies to initiate, maintain and conclude a short
nb: • bruke enkle strategier for å innlede, opprettholde og avslutte en kort

source: everyday life, such as signs, advertisements and animations;
nb: dagliglivet, for eksempel skilt, reklamer og animasjoner

source: • discuss how work, income and consumption can affect personal finances,
nb: • samtale om hvordan arbeid, inntekt og forbruk kan påvirke personlig

source: What is genital mutilation?
nb: Hva er kjønnslemlestelse?

source: The result of this cooperation is a text written in Norwegian where the main character uses Arabic, Dari, English, Lithuanian, Norwegian (both Bokmål and Nynorsk!) and Spanish (Dewilde, 2017).
nb: Resultatet av dette samarbeidet er en tekst som er skrevet på norsk – og hvor hovedpersonen bruker arabisk, dari, engelsk, litauisk, norsk (bokmål og nynorsk!) og spansk (Dewilde, 2017).

source: • collaborate on simple tasks by making suggestions, asking what others
nb: • samarbeide om enkle oppgaver ved å komme med forslag, spørre hva andre

source: • read and understand complex texts that contain illustrations, such as
nb: • lese og forstå sammensatte tekster som inneholder grafiske framstillinger,

source: • describe, explain and justify in brief terms their own actions and plans;
nb: • fortelle om, forklare og kort begrunne egne handlinger og planer

source: Adamczak-Krysztofowicz & Stolarczyk (2014) present a good example of this, describing a collaboration between Polish and German language students.
nb: Et godt eksempel på dette møter vi hos Adamczak-Krysztofowicz & Stolarczyk (2014), som beskriver et sam-arbeid mellom polske og tyske språkstudenter.

source: • read descriptions and instructions related to the work
nb: • skrive notater og huskelapper til seg selv og andre

source: , i.e. that they are not linked to a given (geographical) place/location, but that they – by means of Facebook and YouTube etc. – move between different countries, languages and cultures.
nb: , det vil si at de ikke er knyttet til et bestemt (geografisk) sted men at de – ved hjelp av blant annet Facebook og YouTube – beveger seg mellom ulike land, språk og kulturer.

source: – payments from NAV if you lose your job.
nb: – utbetaling fra NAV hvis man mister jobben.

source: She also explained that there was no shadow when it was twelve o’clock (when the sun reaches its zenith).
nb: Vi samtalte også om hvordan vi leser klokketider på forskjellige språk, og de fleste var enige om at det

source: Production The production element is about oral and written expression in different contexts and for different purposes, and communicating messages intelligibly.
nb: Produksjon Kjerneelementet produksjon handler om å uttrykke seg muntlig og skriftlig i forskjellige sammenhenger og med ulike formål og å formidle budskap på en forståelig måte.

source: This question is not easily answered, but, in our opin-ion, it is important to gain insight into what skills the participants have, what kind of social, digital networks they have access to, which languages they use when they are online and how much they already know about Norway and the Norwegian language, in order to be able to adapt the content, method and organisation of language tuition to the participants’ linguistic and digital abilities.
nb: Det er ikke et spørsmål som kan besvares enkelt, men etter vårt syn er det viktig å skaffe seg innsikt i hvilke digitale ferdigheter deltakerne har, hva slags sosiale, digitale nettverk deltakerne har tilgang til, hvilke språk de bruker når de er på nettet og hvor mye de allerede kan om Norge og norsk språk for slik å kunne tilpasse innhold, metode og organisering i språkopplæringen til deltakernes språklige og digitale forutsetninger.

source: is punishable by imprisonment for up to 10 years.
nb: og kan straffes med fengsel i inntil 10 • Voldtekt som involverer samleie kan

source: • give examples of diversity in Norway, with an emphasis on different family
nb: • gi eksempler på mangfold i Norge med vekt på ulike familieformer, levesett,

source: • give examples of a person's rights and obligations as an employee in terms
nb: • gi eksempler på rettigheter og plikter man har som arbeidstaker, knyttet til

source: In the training, arithmetic work must be based on participants' needs for functional calculation skills in Norwegian, and must be adapted to their capacity for learning and needs, and the demands and challenges they face in their surroundings.
nb: Arbeid med regning i opplæringen skal ta utgangspunkt i hvilke behov deltakerne har for funksjonelle ferdigheter i regning på norsk, og må tilpasses deltakernes egne forutsetninger og behov, samt krav og utfordringer de møter i sine omgivelser.

source: • prepare the daily settlement
nb: • Innvandring og utvandring

source: • read routines for waste disposal in connection with
nb: • Kan lese og forstå beskrivelser av hendelser

source: intercourse, other forms of involuntary sexual activity also constitute
nb: seksuell omgang enn samleie er voldtekt.

source: – there are two different tax classes, 1 and 2.
nb: – det er to ulike skatteklasser, klasse 1 og 2.

source: Blattner & Lomicka’s (2012) Facebook example above shows that it is definitely possible to work on correcting mistakes in connection with com-munication on social media.
nb: Facebook-eksempelet til Blattner &Lomicka (2012) ovenfor viser at det er fullt mulig å jobbe med feilretting i forbindelse med kommunikasjon på sosiale medier.

source: – The prevention and treatment of sexually
nb: – Forebygging og behandling av seksuelt

source: Participants’ Norwegian language goals must be at the minimum level stipulated or higher, but they can be adjusted according to their progress, according to section 27 of the Integration Regulations.
nb: Deltakerens norskmål skal tilsvare det veiledende minimumsnivået eller høyere, men kan justeres opp eller ned ut fra deltakernes progresjon, jf. integreringsforskriften § 27.

source: • read training material related to training courses and
nb: • Kan raskt skumlese lange og komplekse tekster og finne relevante detaljer

source: Textual assignments from the workplace could also be used
nb: EVU-stipend blir i stor grad benyttet av de med al erede høy utdanning.

source: Should I postpone it?
nb: Skal jeg utsette det?

source: The model also takes changes in motivation over time into account (cf. also Dörnyei, 2001).
nb: Modellen tar også hensyn til endring av motivasjon over tid (jf. også Dörnyei, 2001).

source: The teachers and bilingual assistants can also work together to map the situations in which the participants may need to communicate about numbers and numeracy.
nb: Lærere og språkhjelpere kan også i fellesskap prøve å kartlegge i hvilke situasjoner deltakerne har behov for å kommunisere rundt tall og tallforståelse.

source: and he has 3 children to support.
nb: er rettferdig siden han har høye boutgifter og 3 barn å forsørge.

source: • read internal procedures and instructions
nb: • skrive arbeidsordre og dokumentere tilleggsbestillinger

source: By working with the subjects, adult immigrants will learn to use the Norwegian language to create meaning, interact with others and express thoughts, opinions and ideas.
nb: Gjennom arbeidet med faget skal voksne innvandrere lære å bruke det norskespråket til å skape mening, samhandle med andreoguttrykke tanker, synspunkter og ideer.

source: • search for, identify and understand specific, predictable information in
nb: • søke etter, finne og forstå spesifikk, forutsigbar informasjon i enkle,

source: messages and instructions;
nb: beskjeder og instruksjoner

source: • report the work status to managers
nb: • Kan lese og forstå hovedtrekk i fag- og arbeidsrelaterte tekster

source: • acknowledge the receipt of goods
nb: • lese pakksedler og sjekke at de stemmer med leverte

source: Numeracy training and the use of bilingual assistants
nb: Basismatematikk og bruk av språkhjelpere

source: • An intimate partner rape is rape where
nb: • En «relasjonsvoldtekt» er voldtekt der

source: As we saw in the last section, we cannot assume that digitally experienced participants know how to use the internet when learning a new language, and, as Chaplier & Crosnier (2014) show, it can be challenging to adapt a teaching model with the emphasis on independent work for participants whose experience is of teacher-led teaching with little pupil autonomy.
nb: Som vi har sett i forrige avsnitt, kan vi ikke ta for gitt at digitalt erfarne deltaker vet hvordan de kan ta nettet i bruk når de lærer et nytt språk, og som Chaplier & Crosnier (2014) viser kan det være utfordrende å tilpasse seg en under-visningsmodell med stor vekt på selvstendig arbeid for deltakere som har sin erfaring fra (språk)undervisning som er lærerstyrt og i liten grad elevautonom.

source: Lisa and her girlfriends had been out to a bar.
nb: Lisa og venninnene har vært ute på bar.

source: • convey very simple information about time and place;
nb: • videreformidle svært enkel informasjon om tid og sted

source: Occasionally the forklift driver will
nb: • Sosiale medier og nettvett

source: At the same time, participants must learn to use the language skills to handle challenges and tasks in familiar and unfamiliar contexts in everyday life.
nb: Samtidig skal deltakerne lære å bruke språkferdighetene til å håndtere utfordringer og oppgaver i kjente og ukjente sammenhenger i hverdagen.

source: Rape is involuntary sexual activity
nb: Voldtekt er ufrivillig seksuell omgang

source: From a language learning perspective, the question is how migrants’ global, online networks, the internet and social media can help them to learn a new language.
nb: Sett ut i fra et språklæringsperspektiv er spørsmålet hvordan migranters globale, nettbaserte nettverk og bruk av nettet og sosiale medier kan ha betydning for læringen av det nye språket.
